src/Documents/уатНачислениеЗарплаты/уатНачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатНачислениеЗарплаты</name>
  <posting>Deny</posting>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачисленияДатаНачала</name>
    <comment>Период начисления дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачисленияДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <comment>Период регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <comment>Начисления</comment>
    <attributes>
      <name>ВидРасчета</name>
      <comment>Вид расчета</comment>
      <type>
        <types>ChartOfCalculationTypesRef.уатОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <comment>Отработано дней</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноЧасов</name>
      <comment>Отработано часов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>Подразделение организации</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <comment>Результат</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <comment>Сотрудник</comment>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CalculationRegisters/уатОсновныеНачисления/уатОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>уатОсновныеНачисления</name>
  <comment>Основные начисления (уат)</comment>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.уатОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <comment>Сотрудник</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
</mdclass:CalculationRegister>

src/Catalogs/уатВидыИспользованияРабочегоВремени/уатВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатВидыИспользованияРабочегоВремени</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь без оплаты</description>
    </items>
    <items>
      <name>Вахта</name>
      <description>Вахта</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Вынужденный прогул</description>
    </items>
    <items>
      <name>ВыходныеДни</name>
      <description>Выходные дни</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Государственные обязанности</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Дополнительные выходные дни не оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Дополнительные выходные дни оплачиваемые</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>Дополнительный отпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забастовка</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержка выплаты заработной платы</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>КормлениеРебенка</name>
      <description>Кормление ребенка</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>Неоплачиваемый дополнительный отпуск</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>Неоплачиваемый отпуск по законодательству</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>Неоплачиваемый отпуск по разрешению работодателя</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки по невыясненным причинам</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Основной отпуск</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Отпуск на обучение</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Отпуск на обучение неоплачиваемый</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Отпуск по беременности и родам</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>Отпуск по уходу за ребенком</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстранение от работы без оплаты</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстранение от работы с оплатой</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Повышение квалификации</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Повышение квалификации в другой местности</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Праздники</description>
    </items>
    <items>
      <name>ПраздникиБезПовышеннойОплаты</name>
      <description>Праздники без повышенной оплаты</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой по вине работника</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой по вине работодателя</description>
    </items>
    <items>
      <name>РаботаВРежимеНеполногоВремени</name>
      <description>Работа в режиме неполного времени</description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа вечерние часы</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа ночные часы</description>
    </items>
    <items>
      <name>РабочееВремя</name>
      <description>Рабочее время</description>
    </items>
    <items>
      <name>Ремонт</name>
      <description>Ремонт</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Сверхурочные</description>
    </items>
    <items>
      <name>СверхурочныеБезПовышеннойОплаты</name>
      <description>Сверхурочные без повышенной оплаты</description>
    </items>
    <items>
      <name>СокращенноеВремяОбучающихся</name>
      <description>Сокращенное время обучающихся</description>
    </items>
    <items>
      <name>СокращенноеРабочееВремя</name>
      <description>Сокращенное рабочее время</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКакРабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКакЦелодневныйПростой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/ChartsOfCalculationTypes/уатОсновныеНачисления/уатОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>уатОсновныеНачисления</name>
  <comment>(уат)</comment>
  <baseCalculationTypes>ChartOfCalculationTypes.уатОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ДоплатаЗаНочныеЧасы</name>
      <description>Доплата за ночные часы</description>
    </items>
    <items>
      <name>ДоплатаЗаПраздничныеИВыходные</name>
      <description>Доплата за работу в праздники и выходные</description>
    </items>
    <items>
      <name>ОплатаЗаРемонт</name>
      <description>Оплата за участие в ремонте</description>
    </items>
    <items>
      <name>ОплатаПоЧасовомуТарифу</name>
      <description>Оплата по часовому тарифу</description>
    </items>
    <items>
      <name>ПроцентомОтВыручки</name>
      <description>Процентом от выручки</description>
    </items>
    <items>
      <name>ПроцентомОтНачислений</name>
      <description>Процентом от прочих начислений</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата по выработке</description>
    </items>
    <items>
      <name>ФиксированнойСуммой</name>
      <description>Фиксированной суммой</description>
    </items>
  </predefined>
  <attributes>
    <name>КодВидаНачисленияДляВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаОплатыТруда</name>
    <type>
      <types>EnumRef.уатСпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/Documents/уатНачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.НачисленияПодразделениеОрганизации, "Объект.Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПериодРегистрации = ТекущаяДата();
		ОпределитьДатыПериодаНачисления();
	КонецЕсли;
	ОбновитьМесяцПредставление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ОпределитьДатыПериодаНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	ОпределитьДатыПериодаНачисления();
	ОбновитьМесяцПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	стандПериод = Новый СтандартныйПериод;
	стандПериод.Вариант = ВариантСтандартногоПериода.Месяц;
	стандПериод.ДатаНачала = НачалоМесяца(Объект.ПериодНачисленияДатаНачала);
	стандПериод.ДатаОкончания = КонецМесяца(Объект.ПериодНачисленияДатаНачала);
	
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = стандПериод;
	ДиалогВыбораПериода.Показать(Новый ОписаниеОповещения("ВыборПериодаНачисленияЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Элементы.Начисления.ТекущиеДанные.Сотрудник,
	 Новый Структура("Организация, Подразделение", Объект.Организация, Объект.Подразделение), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Элементы.Начисления.ТекущиеДанные.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
	уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", Объект.Организация, Объект.Дата);
	уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьПоОсновнымНачислениям(Команда)
	Если Объект.Начисления.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Table will be cleared before filling! Continue?';ru='Перед заполнением таблица будет очищена! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОсновнымНачислениямЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
        Возврат;  
	КонецЕсли;  
	
	ЗаполнитьПоОсновнымНачислениямФрагмент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОпределитьДатыПериодаНачисления()
	Объект.ПериодНачисленияДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
	Объект.ПериодНачисленияДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

// Функция возвращает дату в формате месяц прописью + год
// Например, "Январь 2008"
&НаКлиенте
Функция ДатаКакМесяцПредставление(ДатаДата)
	Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
КонецФункции // ДатаКакМесяцПредставление()

&НаКлиенте
Функция ОбновитьМесяцПредставление()
	МесяцСтрока = ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецФункции

&НаСервере
Процедура ЗаполнитьОсновнымиНачислениями()
	
	тблРабочееВремяПоПодразделениям = уатОбщегоНазначения.РабочееВремяСотрудниковПоПодразделениям(
		Объект.ПериодНачисленияДатаНачала, КонецДня(Объект.ПериодНачисленияДатаОкончания),, Объект.Организация);
	
	Запрос = Новый Запрос;
    Запрос.Текст =
	"ВЫБРАТЬ
	|	тблРабочееВремяПоПодразделениям.Сотрудник КАК Сотрудник,
	|	тблРабочееВремяПоПодразделениям.Подразделение КАК Подразделение,
	|	тблРабочееВремяПоПодразделениям.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	тблРабочееВремяПоПодразделениям.ДатаРаботы КАК ДатаРаботы,
	|	тблРабочееВремяПоПодразделениям.ВремяОборот КАК ВремяОборот
	|ПОМЕСТИТЬ ВТ_РабочееВремяПоПодразделениям
	|ИЗ
	|	&тблРабочееВремяПоПодразделениям КАК тблРабочееВремяПоПодразделениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение КАК Подразделение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатРабочееВремяСотрудниковОбороты.ДатаРаботы) КАК ДнейОборот,
	|	СУММА(уатРабочееВремяСотрудниковОбороты.ВремяОборот) КАК ВремяОборот
	|ПОМЕСТИТЬ ВТ_Работа
	|ИЗ
	|	ВТ_РабочееВремяПоПодразделениям КАК уатРабочееВремяСотрудниковОбороты
	|ГДЕ
	|	(уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.уатВидыИспользованияРабочегоВремени.Явка)
	|			ИЛИ уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.уатВидыИспользованияРабочегоВремени.Праздники))
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение КАК Подразделение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уатРабочееВремяСотрудниковОбороты.ДатаРаботы) КАК ДнейОборот,
	|	СУММА(уатРабочееВремяСотрудниковОбороты.ВремяОборот) КАК ВремяОборот
	|ПОМЕСТИТЬ ВТ_Ремонты
	|ИЗ
	|	ВТ_РабочееВремяПоПодразделениям КАК уатРабочееВремяСотрудниковОбороты
	|ГДЕ
	|	уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.уатВидыИспользованияРабочегоВремени.Ремонт)
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник,
	|	уатРабочееВремяСотрудниковОбороты.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	уатОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	СУММА(уатОсновныеНачисления.Результат) КАК Результат,
	|	уатОсновныеНачисления.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрРасчета.уатОсновныеНачисления КАК уатОсновныеНачисления
	|ГДЕ
	|	уатОсновныеНачисления.Организация = &Организация
	|	И уатОсновныеНачисления.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
	|
	|СГРУППИРОВАТЬ ПО
	|	уатОсновныеНачисления.Сотрудник,
	|	уатОсновныеНачисления.ВидРасчета,
	|	уатОсновныеНачисления.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Ремонты.Сотрудник ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Работа.Сотрудник ЕСТЬ NULL
	|						ТОГДА ВТ_Начисления.Сотрудник
	|					ИНАЧЕ ВТ_Работа.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Ремонты.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_Ремонты.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Работа.Подразделение ЕСТЬ NULL
	|						ТОГДА ВТ_Начисления.Подразделение
	|					ИНАЧЕ ВТ_Работа.Подразделение
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Ремонты.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВТ_Работа.ДнейОборот КАК Дней,
	|	ВТ_Работа.ВремяОборот КАК Время,
	|	ВТ_Ремонты.ДнейОборот КАК ДнейВРемонте,
	|	ВТ_Ремонты.ВремяОборот КАК ВремяВРемонте,
	|	ВТ_Начисления.ВидРасчета КАК ВидРасчета,
	|	ВТ_Начисления.Результат КАК Результат
	|ПОМЕСТИТЬ ВТ_ОбщаяТаблица
	|ИЗ
	|	ВТ_Работа КАК ВТ_Работа
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|			ПО (ВТ_Ремонты.Сотрудник = ВТ_Начисления.Сотрудник)
	|				И (ВТ_Ремонты.Подразделение = ВТ_Начисления.Подразделение)
	|		ПО ВТ_Работа.Сотрудник = ВТ_Начисления.Сотрудник
	|			И ВТ_Работа.Подразделение = ВТ_Начисления.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_ОбщаяТаблица.ВидРасчета КАК ВидРасчета,
	|	ВТ_ОбщаяТаблица.Результат КАК Результат,
	|	ВТ_ОбщаяТаблица.Сотрудник КАК Сотрудник,
	|	ВТ_ОбщаяТаблица.Дней КАК Дней,
	|	ЕСТЬNULL(ВТ_ОбщаяТаблица.Время, 0) КАК Время,
	|	ВЫБОР
	|		КОГДА ВТ_ОбщаяТаблица.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу)
	|				ИЛИ ВТ_ОбщаяТаблица.ВидРасчета ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьЧасы,
	|	ВТ_ОбщаяТаблица.ДнейВРемонте КАК ДнейВРемонте,
	|	ВТ_ОбщаяТаблица.ВремяВРемонте КАК ВремяВРемонте,
	|	ВТ_ОбщаяТаблица.Подразделение КАК ПодразделениеОрганизации
	|ИЗ
	|	ВТ_ОбщаяТаблица КАК ВТ_ОбщаяТаблица
	|ГДЕ
	|	(&Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ИЛИ ВТ_ОбщаяТаблица.Подразделение = &Подразделение)
	|ИТОГИ
	|	СУММА(Результат),
	|	МАКСИМУМ(Дней),
	|	МАКСИМУМ(Время),
	|	МАКСИМУМ(ЕстьЧасы),
	|	МАКСИМУМ(ПодразделениеОрганизации)
	|ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
    Запрос.УстановитьПараметр("ДатаНач",       Объект.ПериодНачисленияДатаНачала);
    Запрос.УстановитьПараметр("ДатаКон",       КонецДня(Объект.ПериодНачисленияДатаОкончания));
    Запрос.УстановитьПараметр("Организация",   Объект.Организация);
	Запрос.УстановитьПараметр("тблРабочееВремяПоПодразделениям",   тблРабочееВремяПоПодразделениям);
	
    Результат = Запрос.Выполнить();
    
    ВыборкаСотрудник = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СправочникПодразделенияПустаяСсылка = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	
    Пока ВыборкаСотрудник.Следующий() Цикл
		Если ВыборкаСотрудник.Сотрудник = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник.Организация) И (ВыборкаСотрудник.Результат <> NULL ИЛИ ВыборкаСотрудник.Дней <> NULL) Тогда
			ТекстНСТР = НСтр(
				"en='Charges %1, days %2, hours %3 of the driver ""%4"" can not be reflected in the document, so it is not listed in any company.';"
				"ru='Начисления %1, дни %2, часы %3 водителя ""%4"" не могут быть отражены в документе, так он не числится ни в одной организации.'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, ВыборкаСотрудник.Результат, ВыборкаСотрудник.Дней, Окр(ВыборкаСотрудник.Время/3600,2), ВыборкаСотрудник.Сотрудник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Иначе
            ВыборкаДетали = ВыборкаСотрудник.Выбрать();
			КоличествоСтрокПоСотруднику = 0;
			
            Пока ВыборкаДетали.Следующий() Цикл
                НоваяСтрока = Объект.Начисления.Добавить();
                НоваяСтрока.Сотрудник  = ВыборкаДетали.Сотрудник;
                НоваяСтрока.Результат  = ?(ВыборкаДетали.Результат  = NULL,0,ВыборкаДетали.Результат);
                НоваяСтрока.ВидРасчета = ?(ВыборкаДетали.ВидРасчета = NULL,
										ПланыВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу, ВыборкаДетали.ВидРасчета);
                
				Если ВыборкаДетали.ВидРасчета = NULL ИЛИ
						ВыборкаДетали.ВидРасчета = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу Тогда
                    НоваяСтрока.ОтработаноДней =  ?(ВыборкаДетали.Дней= NULL,0,ВыборкаДетали.Дней);
                    НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаДетали.Время= NULL,0,Окр(ВыборкаДетали.Время/3600,2));
                КонецЕсли; 
                Если ВыборкаДетали.ВидРасчета = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт Тогда
                    НоваяСтрока.ОтработаноДней =  ?(ВыборкаДетали.ДнейВРемонте= NULL,0,ВыборкаДетали.ДнейВРемонте);
                    НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаДетали.ВремяВРемонте= NULL,0,
													Окр(ВыборкаДетали.ВремяВРемонте/3600,2));
                КонецЕсли; 
                
                НоваяСтрока.ПодразделениеОрганизации = ?(ВыборкаДетали.ПодразделениеОрганизации = NULL, 
														СправочникПодразделенияПустаяСсылка, ВыборкаДетали.ПодразделениеОрганизации) ;
														
                КоличествоСтрокПоСотруднику = КоличествоСтрокПоСотруднику + 1;
            КонецЦикла;
			
			// Строка с заполненным отработанными часами и днями добавляется, только если по сотруднику
			// не было начислений с видом ОплатаПоЧасовомуТарифу.
			// Если не добавлять эту строку, то теряется информация по отработанным часам и дням.
			Если ВыборкаСотрудник.ЕстьЧасы = 0 И ВыборкаСотрудник.Дней <> NULL Тогда
				Если КоличествоСтрокПоСотруднику = 1 И НоваяСтрока.ОтработаноДней = 0 И НоваяСтрока.ОтработаноЧасов = 0 Тогда
					// Если у сотрудника есть только одна строка с заполненной суммой и незаполнеными днями и часами,
					// то дни и часы записываются в неё, и новая строка не создается
					НоваяСтрока.ОтработаноДней  =  ?(ВыборкаСотрудник.Дней= NULL,0,ВыборкаСотрудник.Дней);
					НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаСотрудник.Время= NULL,0,
													Окр(ВыборкаСотрудник.Время/3600,2));
				Иначе
					// Иначе добавляется новая строка с нулевой суммой и заполненными днями и часами
					НоваяСтрока = Объект.Начисления.Добавить();
					НоваяСтрока.Сотрудник = ВыборкаСотрудник.Сотрудник;
					НоваяСтрока.ВидРасчета = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаПоЧасовомуТарифу;
					НоваяСтрока.ПодразделениеОрганизации = ?(ВыборкаДетали.ПодразделениеОрганизации = NULL, 
					СправочникПодразделенияПустаяСсылка, ВыборкаСотрудник.ПодразделениеОрганизации) ;
					НоваяСтрока.ОтработаноДней  =  ?(ВыборкаСотрудник.Дней= NULL,0,ВыборкаСотрудник.Дней);
					НоваяСтрока.ОтработаноЧасов =  ?(ВыборкаСотрудник.Время= NULL,0,
													Окр(ВыборкаСотрудник.Время/3600,2));
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОсновнымНачислениямЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    Иначе
        Объект.Начисления.Очистить();
    КонецЕсли;  
    
    ЗаполнитьПоОсновнымНачислениямФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОсновнымНачислениямФрагмент()
    
    ЗаполнитьОсновнымиНачислениями();

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаНачисленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПериодРегистрации = НачалоМесяца(Результат.ДатаНачала);
	
	ОпределитьДатыПериодаНачисления();
	ОбновитьМесяцПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока = Истина
		И НЕ Копирование Тогда
		ТекСтрока = Элементы.Начисления.ТекущиеДанные;
		ТекСтрока.ПодразделениеОрганизации = Объект.Подразделение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
